#pragma once

//タイピングの問題を作ります
#include <Siv3D.hpp>




Array<String> Страшно =
{
	U"Честная, честная",
	U"Честная, честная",
	U"Честная, честная",

	U"Тебе не справиться",
	U"Но им не нравится",
	U"Знать наперёд",
	U"Кто не дойдет",
	U"А женщины красятся",
	U"И дети прячутся",
	U"Встать в хоровод",
	U"Никто не врёт",

	U"Тебе не нравится",
	U"И им не нравится",
	U"Спят сыновья",
	U"Молчит семья",
	U"Наивно уставился",
	U"И планы правятся",
	U"В ответе я, с кем спит моя",

	U"Тебе не справиться",
	U"И им не справиться",
	U"Лёд не спасет",
	U"Майор идёт",
	U"А женщины красятся",
	U"И дети прячутся",
	U"Встать в хоровод",
	U"Никто не врёт (да)",

	U"Потому и страшно, потому и страшно",
	U"Потому и страшно, потому и страшно",
	U"Потому и страшно, потому и страшно",
	U"Потому и страшно, потому и страшно",

	U"Вечная, вечная",
	U"Вечная, вечная",
	U"Наверное, верная",
	U"Честная, честная",
	U"Честная нация (на-)",
	U"Честная, честная",

	U"Та-та-та-та",
	U"Та-та-та",
	U"Та-та-та-та",
	U"Та-та-та",
	U"Та-та-та-та",
	U"Та-та-та",

	U"Тебе не справиться",
	U"И им не справиться",
	U"Лёд не спасет",
	U"Кто не пройдет",
	U"А женщины красятся",
	U"И дети прячутся",
	U"Встать в хоровод",
	U"Майор идёт (да)",

	U"Потому и страшно, потому и страшно",
	U"Потому и страшно, потому и страшно",
	U"Потому и страшно, потому и страшно",
	U"Потому и страшно, потому и страшно",

	U"Вечная, вечная",
	U"Вечная, вечная",
	U"Навечно вечная, вечная-я",
	U"Честная, честная",
	U"Честная нация (на-)",
	U"Честная, честная-я",

};

Array<String> Нелюбовь =
{
	U"Ниже рёбер",
	U"Ниже воспаления",
	U"Ниже живота",
	U"Ниже бёдер",
	U"Ниже преступления",
	U"Ниже голода",
	U"Ниже скуки",
	U"Ниже отвращения",
	U"Ниже кобеля",
	U"Ниже суки",
	U"Ниже оскорбления",
	U"Нелюбовь моя",

	U"Даже не успела",
	U"Даже не успела",
	U"Никому себя продать",
	U"Молодость хотела",
	U"Молодость хотела",
	U"Молодость хотела знать",
	U"Так и не сумела",
	U"Так и не сумела",
	U"Никого сама предать",
	U"Родина вскормила",
	U"Родина вскормила",
	U"Родина вскормила блядь",

	U"Тише горя",
	U"Тише утешения",
	U"Громче праздника",
	U"Чище крови",
	U"Чище унижения",
	U"Нелюбовь моя",

	U"Даже не успела",
	U"Даже не успела",
	U"Никому себя продать",
	U"Молодость хотела",
	U"Молодость хотела",
	U"Молодость хотела знать",
	U"Так и не сумела",
	U"Так и не сумела",
	U"Никого сама предать",
	U"Родина вскормила",
	U"Родина вскормила",
	U"Родина вскормила блядь",
};

Array<String> Поломало =
{
	U"О, я помню как портилась кровь",
	U"Как сомнением мучало плоть",
	U"Пока спала",
	U"Беда текла",
	U"Сквозь рукава",

	U"Поломало тебя, поломало",
	U"Поломало тебя, сломало тебя",
	U"Поломало, но мало, но мало",
	U"Только мало-помалу не стало-ла",

	U"И я помню как портилась кровь",
	U"И я видел и увижу вновь",
	U"Стой и смотри",
	U"Как всё к черту сгорит",
	U"Как всё горит",

	U"Поломало тебя, поломало",
	U"Поломало тебя, сломало тебя",
	U"Поломало, но мало, но мало",
	U"Только мало-помалу не стало-ла",
	U"Поломало тебя, поломало",
	U"Поломало тебя, сломало тебя",
	U"Поломало, но мало, но мало",
	U"Только мало-помалу сломало",
	U"Поломало тебя, поломало",
	U"Поломало тебя, но сломало, сломало",
	U"Поломало тебя, поломало",
	U"Поломало тебя, сломало тебя",
	U"Поломало, но мало, но мало",
	U"Только мало-помалу сломало-ла",
};

Array<String> ТолькоХужеСтало =
{
	U"Да, ты можешь молчать, если хочешь молчать",
	U"Север смотрит на нас, север ставит печать",
	U"Тш-ш-ш",
	U"Тш-ш-ш",
	U"Тш-ш-ш",
	U"Тш-ш-ш",

	U"Да, ты можешь сказать, если есть, что сказать",
	U"Овцы смотрят на юг, прямо собаке в пасть",
	U"Сам не зная, о чём так плакала мать",
	U"Кто-то начал отсчёт, кто-то начал считать",

	U"Раз, пять, три, два, шесть",
	U"А-а-а-а-а-а-а-а!",
	U"Сто!",

	U"Стало, стало, всё только хуже стало",
	U"Хуже стало, всё хуже, хуже стало",
	U"Только стало, всё только хуже стало",
	U"Ла-ла-ла-ла, ла-ла-ла-ла-ла-ла",

	U"Да, ты можешь молчать, кто-то должен молчать",
	U"Ветер гонит зерно прямо собаке в пасть",
	U"Тш-ш-ш",
	U"Тш-ш-ш",
	U"Тш-ш-ш",
	U"Тш-ш-ш",

	U"Да, но только стало",
	U"Всё только хуже стало",
	U"Ла-ла-ла",
	U"Хуже, хуже стало",
	U"Всё только хуже стало",
	U"Ла-ла-ла",
	U"Стало, всё только хуже стало",
	U"Хуже стало, всё хуже, хуже стало, хуже стало",
	U"И где-то хуже стало, хуже стало",

	U"Ла-ла-ла-ла, ла-ла-ла-ла-ла-ла",
	U"Ла-ла-ла-ла, ла-ла-ла-ла-ла-ла",
};


Array<String> ТакЗакаляласьСталь =
{
	U"Так строят на века",
	U"Так накрывают стол",
	U"Так смотрит на врага",
	U"Врач, делая укол",

	U"Так закалялась сталь",
	U"Так предают жену",
	U"И всем немного жаль",
	U"Ту признавать вину",

	U"Так мажется рука",
	U"Так закрывают рот",
	U"Так строят на века",
	U"Так женщин бьют в живот",

	U"Так закалялась сталь",
	U"Так предают жену",
	U"И близится февраль",
	U"С северу, к северу",

	U"Так мажется рука",
	U"Так накрывают стол",
	U"Да, было на века",
	U"Так женщин бьют в живот",
};

Array<String> Стыд =
{
	U"Стыд ?",
	U"Что ещё за стыд ?",
	U"Бит ?",
	U"Уже трижды бит",
	U"Дойдёт до ста",

	U"Та, та - та - та, та, та - та - та - та",
	U"Та, та - та - та, та, та - та - та - та",
	U"Та, та - та - та, та, та - та - та - та - а - а",
	U"Дойдёт, дойдёт до ста",
	U"Та, та - та - та, та, та - та - та - та",
	U"Та, та - та - та, та, та - та - та - та",
	U"Та, та - та - та, та, та - та - та - та - а - а",
	U"Дойдёт до ста",

	U"Молодая пела о весне",
	U"Тело пожелтело в простыне",
	U"Точно злак, точно злак",
	U"Больше нет предела в наготе",
	U"Давит, то и дело, в голове",
	U"Пусто так…",

	U"Нет ничего, в этом ничего нет",
	U"Нет ничего, в тебе ничего нет",
	U"Нет никого, нет никого, нет!",
	U"Пусто так...",
	U"Нет ничего, в этом ничего нет",
	U"Нет ничего, в тебе ничего нет",
	U"Нет никого, нет никого, нет!",

	U"Спрос ?",
	U"На тебя есть спрос",
	U"Пёс ?",
	U"Да какой ты пёс ?",
	U"Дойдёт до ст",

	U"Э, э - э - э, э, э - э - э - э",
	U"Э, э - э - э, э, э - э - э - э",
	U"Э, э - э - э, э, э - э - э - э",
	U"Эо!",
	U"Эо!",

	U"Молодая пела о любви",
	U"Тело потемнело, как угли",
	U"Просто так, просто так",
	U"Больше нет предела в наготе",
	U"Давит, то и дело, в голове",
	U"Пусто так, пусто так",
};

Array<String> ОтвечайЗаСлова =
{
	U"Спит пространство двора и спит детвора",
	U"Тихо, и на окне стоят образа",
	U"Спит рабочий и с ним вторая жена",
	U"Спит, как будто бы никогда не лгала, ла-ла",
	U"(Никогда не лгала, ла-ла)",
	U"(Никогда-никогда)",

	U"На снег, положили на снег",
	U"Положили на снег, положили тела",
	U"За всех, ты ответишь за всех",
	U"Ты ответишь за всех, отвечай за слова",
	U"И если так давит ноша",
	U"А горло просит ножа",
	U"Отвечай, отвечай, отвечай, отвечай",
	U"Отвечай за слова!",
	U"На два, подели всё на два",
	U"Подели всё на два, подели всё на два",
	U"Раз-два, отвечай за слова",
	U"Отвечай за слова, отвечай за слова",
	U"И если так давит ноша",
	U"А горло просит ножа",
	U"Отвечай, отвечай, отвечай, отвечай",
	U"Отвечай за слова!",

	U"День забрал, ночь дала, ла-ла-ла-ла-ла",
	U"Душно, и по утрам болит голова",
	U"Спит рабочий и с ним вторая жена",
	U"Так, как будто бы никогда не лгала",
	U"Ла-ла-ла-ла-ла-ла",
	U"Ла-ла-ла-ла-ла-ла-ла-ла-ла-ла-ла-ла",
	U"Ла-ла-ла-ла-ла-ла-ла-ла-ла-ла-ла-ла",
	U"Ла-ла-ла-ла-ла-ла-ла-ла-ла-ла-ла-ла",
	U"(Никогда да)",

	U"На снег, положили на снег",
	U"Положили на снег, положили тела",
	U"За всех, ты ответишь за всех",
	U"Ты ответишь за всех, отвечай за слова",
	U"И если так давит ноша",
	U"А горло просит ножа",
	U"Отвечай, отвечай, отвечай, отвечай",
	U"Отвечай за слова!",
	U"На два, подели всё на два",
	U"Подели всё на два, подели всё на два",
	U"Раз-два, отвечай за слова",
	U"Отвечай за слова, отвечай за слова",
	U"И если так давит ноша",
	U"А горло просит ножа",
	U"Отвечай, отвечай, отвечай, отвечай",
	U"Отвечай за слова!",
};


Array<String> Ножевой =
{
	U"Теперь пой - пой, что живой",
	U"Теперь слушай, думай головой",
	U"Теперь злой, злой, как цепной",
	U"А - а - а",
	U"Ляжем, ляжем в стороне",
	U"Гнить — так рядом на спине",
	U"Скоро будем наравне",
	U"А - а - а",

	U"Теперь пой - пой, что живой",
	U"Теперь думай - думай, кто святой",
	U"Теперь злой, злой, как цепной",
	U"А - а - а",

	U"Ляжем, ляжем на спине",
	U"Гнить — так сукой в стороне",
	U"Скоро будем наравне",
	U"А - а - а",

	U"Здесь нет спешки",
	U"Слова несвежи",
	U"А - а - а",
	U"Пахнет печкой",
	U"Тошнит от свечки",
	U"Алтарь",

	U"Теперь стой, стой как герой",
	U"Смотрит, смотрит постовой",
	U"А - а - а",
	U"Каждый твой - твой, ножевой",
	U"Режет, режет по живой",
	U"А - а - а",

	U"Теперь пой - пой, что живой",
	U"Теперь слушай, думай головой",
	U"Теперь злой, злой, как цепной",
	U"А - а - а",
	U"Ляжем, ляжем в стороне",
	U"Гнить — так рядом на спине",
	U"Скоро будем наравне",
	U"А - а - а",

	U"Нет надежды",
	U"И суд закончился — сядь",
	U"Всё как прежде",
	U"Я симпатичная мразь",

	U"Теперь пой - пой, что живой",
	U"Смотрит, смотрит постовой",
	U"А - а - а",
	U"Каждый твой, мой, ножевой",
	U"Режет, режет по живой",
	U"А - а - а",

	U"Теперь пой - пой, что живой",
	U"Теперь слушай, думай головой",
	U"Теперь злой, злой, как цепной",
	U"А - а - а",
	U"Ляжем, ляжем в стороне",
	U"Гнить — так рядом на спине",
	U"И скоро будем наравне",
	U"А - а - а",

	U"Теперь пой - пой, что живой",
	U"Теперь думай, думай, кто святой",
	U"Теперь злой, злой, как цепной",
	U"А - а - а",
	U"Ляжем, ляжем в стороне",
	U"Гнить — так рядом на спине",
	U"И скоро будем наравне",
	U"А - а - а",
};

Array<String> ЖизньЗаЦаря =
{
	U"Царь прощает",
	U"Царь даёт",
	U"Мужчина кровь сдаёт",
	U"Глория",
	U"Сын родится",
	U"Мать умрёт",
	U"Солдат икону трёт",
	U"Глория",

	U"Царь стареет",
	U"Кровь гниёт",
	U"И женщина поёт",
	U"Глория",
	U"Станем, станем старше",
	U"Когда затянем маршем",
	U"Но Глория",

	U"Так рушится строй",
	U"Русской тоской",
	U"Стоять стеной",
	U"Травой",
	U"Будешь царю сестрой",
	U"В стране святой",

	U"Скоро станем, скоро станем",
	U"Скоро станем старше",
	U"Скоро станем, скоро станем",
	U"Скоро станем старше",
	U"За царя, за царя",
	U"Здесь стреляют дважды",
	U"За царя, за царя",
	U"Здесь стреляют два",

	U"Царь прощает",
	U"Царь даёт",
};


Array<Array<String>> shortparis_RedFlag =
{
	Страшно,
	Нелюбовь,
	Поломало,
	ТолькоХужеСтало,
	ТакЗакаляласьСталь,
	Стыд,
	ОтвечайЗаСлова,
	Ножевой,
	ЖизньЗаЦаря,
};
