#pragma once


// 問題文のリスト
const Array<String> аWords =
{
	U"август",
	U"автобус",
	U"авторучка",
	U"алкоголь",
	U"английский язык",
	U"апрель",

};

const Array<String> бWords1 =
{
    U"бабушка",
    U"багаж",
    U"банк",
    U"бассейн",
    U"бегать",
    U"белый",
    U"библиотека",
    U"билет",
    U"близкий",
    U"близко"
};

const Array<String> бWords2 =
{
	U"блюдо",
	U"бодрый",
	U"болезнь",
	U"болеть",
	U"больница",
	U"большой",
	U"брат",
	U"брать",
	U"брюки",
	U"бумага",
	U"бумажник",
	U"быстрый"
};

const Array<String> вWords1 =
{
   U"в",
   U"ванная",
   U"велосипед",
   U"весёлый",
   U"весна",
   U"весь",
   U"ветер",
   U"вечер",
   U"вешать",
   U"взрослый",

};


const Array<String> вWords2 =
{

   U"вилка",
   U"вино",
   U"вкусно",
   U"вне",
   U"возвращаться",
   U"вопрос",
   U"ворота",
   U"воскресенье",
   U"восток",
   U"впереди",

};

const Array<String> вWords3 =
{

   U"впитывать",
   U"врач",
   U"время",
   U"все",
   U"вставать",
   U"встать",
   U"встретить",
   U"вторая половина дня",
   U"вторник",
   U"вход",

};

const Array<String> вWords4 =
{
   U"вчера",
   U"вчера вечером",
   U"вы",
   U"высота",
   U"выход",
   U"выходить"
};




